title = Gi\u1edbi thi\u1ec7u v\u1ec1 Poma
content = POMA \u0111\u01b0\u1ee3c x\u00e2y d\u1ef1ng d\u1ef1a tr\u00ean m\u1ed9t lo\u1ea1t c\u00e1c c\u00f4ng ngh\u1ec7 m\u1edf, mi\u1ec5n ph\u00ed theo \u0111\u00fang ti\u00eau ch\u00ed c\u1ee7a cu\u1ed9c thi \u0111\u1ec1 ra. Server c\u1ee7a POMA \u0111\u01b0\u1ee3c x\u00e2y d\u1ef1ng tr\u00ean n\u1ec1n c\u00f4ng ngh\u1ec7 GWT -Google Web Toolkit v\u00e0 \u0111\u1eb7t tr\u00ean App Engine c\u1ee7a Google. Nh\u1edd v\u1eady POMA s\u1ebd kh\u00f4ng ph\u1ea3i t\u1ed1n c\u00e1c chi ph\u00ed \u0111\u1ec3 b\u1ea3o tr\u00ec hay thu\u00ea server. C\u00e1c r\u1ee7i ro kh\u00e1c v\u1ec1 ph\u00eda Server nh\u1edd v\u1eady s\u1ebd \u0111\u01b0\u1ee3c gi\u1ea3m \u0111\u1ebfn m\u1ee9c t\u1ed1i thi\u1ec3u (c\u00e2n b\u1eb1ng t\u1ea3i, b\u0103ng th\u00f4ng, sao l\u01b0u d\u1eef li\u1ec7u...). C\u00f4ng c\u1ee5 ch\u00ednh \u0111\u1ec3 ph\u00e1t tri\u1ec3n POMA d\u00e0nh cho c\u00e1c l\u1eadp tr\u00ecnh vi\u00ean l\u00e0 Eclipse v\u00e0 GWT plugin c\u0169ng l\u00e0 nh\u1eefng s\u1ea3n ph\u1ea9m ngu\u1ed3n m\u1edf \u0111\u01b0\u1ee3c cung c\u1ea5p mi\u1ec5n ph\u00ed. Ch\u1ec9 v\u1edbi m\u1ed9t v\u00e0i thao t\u00e1c \u0111\u01a1n gi\u1ea3n, l\u1eadp tr\u00ecnh vi\u00ean c\u00f3 th\u1ec3 tri\u1ec3n khai (deploy) \u1ee9ng d\u1ee5ng l\u00ean App Engine, gi\u00fap ti\u1ebft ki\u1ec7m c\u00f4ng s\u1ee9c c\u1ee7a l\u1eadp tr\u00ecnh vi\u00ean.<br><br> Nh\u01b0 v\u1eady, trong xuy\u00ean su\u1ed1t qu\u00e1 tr\u00ecnh ph\u00e1t tri\u1ec3n v\u00e0 \u0111\u01b0a s\u1ea3n ph\u1ea9m v\u00e0o s\u1eed d\u1ee5ng, POMA s\u1eed d\u1ee5ng nh\u1eefng c\u00f4ng ngh\u1ec7 ngu\u1ed3n m\u1edf, nh\u00e0 ph\u00e1t tri\u1ec3n s\u1ebd kh\u00f4ng g\u1eb7p b\u1ea5t k\u1ef3 kh\u00f3 kh\u0103n n\u00e0o v\u1ec1 v\u1ea5n \u0111\u1ec1 b\u1ea3n quy\u1ec1n, thu\u1eadn l\u1ee3i cho c\u00e1c nh\u00e0 ph\u00e1t tri\u1ec3n sau n\u00e0y c\u00f3 th\u1ec3 ph\u00e1t tri\u1ec3n \u1ee9ng d\u1ee5ng theo h\u01b0\u1edbng th\u00edch h\u1ee3p \u0111\u1ec3 ph\u1ee5c v\u1ee5 cho c\u00e1c nhu c\u1ea7u c\u1ee5 th\u1ec3. C\u00e1c chi ph\u00ed \u0111\u1ec3 ph\u00e1t tri\u1ec3n v\u00e0 \u1ee9ng d\u1ee5ng POMA c\u0169ng \u0111\u01b0\u1ee3c gi\u1ea3m thi\u1ec3u t\u1ed1i \u0111a n\u00ean t\u00ednh kh\u1ea3 thi c\u1ee7a \u0111\u1ec1 t\u00e0i r\u1ea5t cao, s\u1ea3n ph\u1ea9m th\u1eadm ch\u00ed c\u00f3 th\u1ec3 th\u00edch h\u1ee3p cho c\u1ea3 \u0111\u1ed1i t\u01b0\u1ee3ng l\u00e0 c\u00e1 nh\u00e2n c\u00f3 nhu c\u1ea7u. Hay ta c\u00f3 th\u1ec3 n\u00f3i, chi ph\u00ed \u0111\u1ec3 ph\u00e1t tri\u1ec3n POMA ch\u1ec9 l\u00e0 chi ph\u00ed v\u1ec1 con ng\u01b0\u1eddi.

